import math

print()
# hw1
a1 = 3
b1 = 5
c1 = 7
var1 = (a1 + b1) * (c1 / 2)
print("Задание 1 \nРезультат выражения a + b * ( c / 2 ) \nдля произвольных значений"
      " при a: %d "
      "  b: %d " 
      "  c: %d " 
      " \nравен: %d "
      % (a1, b1, c1, var1))

print()
# hw2
a2 = 3.5
b2 = 5.5
var2 = ((a2 ** 2) + (b2 ** 2)) % 2
print("Задание 2 \nРезультат выражения (a2 + b2) %% 2 \nдля произвольных значений"
      " при a: %.1f "
      "  b: %.1f " 
      " \nравен: %.1f "
      % (a2, b2, var2))


print()
# hw3
a3 = 3.5
b3 = 5.5
c3 = 7.5
var3 = ((a3 + b3) / ((12 * c3) % 4)) + b3
print("Задание 3 \nРезультат выражения ( a + b ) / 12 * c %% 4 + b "
      "\nдля произвольных значений"
      " при a: %.1f"
      "  b: %.1f" 
      "  c: %.1f" 
      " \nравен: %.1f "
      % (a3, b3, c3, var3))


print()
# hw4
a4 = 3.7
b4 = 5.2
c4 = 7.5
var4 = (a4 - (b4 * c4)) / ((a4 + b4) % c4)
print("Задание 4 \nРезультат выражения (a - b * c ) / ( a + b ) %% c "
      "\nдля произвольных значений"
      " при a: %.1f"
      "  b: %.1f" 
      "  c: %.1f" 
      " \nравен: %f "
      % (a4, b4, c4, var4))


print()
# hw5
a5 = 2
b5 = 4
c5 = 6
var5 = ((math.fabs(3-5))/((3+5)**3))-(math.cos(7))
print("Задание 5 \nРезультат выражения | a - b | /( a + b)^3 - cos( c )"
      "\nдля произвольных значений"
      " при a: %d"
      "  b: %d" 
      "  c: %d" 
      " \nравен: %f "
      % (a5, b5, c5, var5))


print()
# hw6
a6 = 2
b6 = 4
c6 = 6
var6 = (((math.log1p(c6))/(-b6))**4)+(math.fabs(a6))
print("Задание 6 \nРезультат выражения  ln( 1 + c ) / -b )^4 + | a |"
      "\nдля произвольных значений"
      " при a: %d"
      "  b: %d" 
      "  c: %d" 
      " \nравен: %f "
      % (a6, b6, c6, var6))
